Repository: lalupj07/FamBudget
Catalog: fambudget_flutter/lib/l10n/app_*.arb
Languages: ml, ta, te

source: Settings
ml: ക്രമീകരണങ്ങൾ
ta: அமைப்புகள்
te: సెట్టింగ్‌లు

source: Profile
ml: പ്രൊഫൈൽ
ta: சுயவிவரம்
te: ప్రొఫైల్

source: Edit profile
ml: പ്രൊഫൈൽ എഡിറ്റ് ചെയ്യുക
ta: சுயவிவரத்தைத் திருத்து
te: ప్రొఫైల్ సవరించు

source: Add profile photo
ml: പ്രൊഫൈൽ ഫോട്ടോ ചേർക്കുക
ta: சுயவிவர படம் சேர்
te: ప్రొఫైల్ ఫోటో జోడించు

# changeProfilePhoto
source: Change photo
ml: ഫോട്ടോ മാറ്റുക
ta: படத்தை மாற்று
te: ఫోటో మార్చు

# removeProfilePhoto
source: Remove photo
ml: ഫോട്ടോ നീക്കം ചെയ്യുക
ta: படத்தை அகற்று
te: ఫోటో తొలగించు

source: Name
ml: പേര്
ta: பெயர்
te: పేరు

source: Email
ml: ഇമെയിൽ
ta: மின்னஞ்சல்
te: ఇమెయిల్

source: Household name
ml: വീട്ടിലെ പേര്
ta: குடும்பப் பெயர்
te: కుటుంబ పేరు

source: Save
ml: സംരക്ഷിക്കുക
ta: சேமி
te: సేవ్ చేయి

source: Cancel
ml: റദ്ദാക്കുക
ta: ரத்து
te: రద్దు చేయి

source: Appearance
ml: രൂപം
ta: தோற்றம்
te: రూపం

source: Dark mode
ml: ഡാർക്ക് മോഡ്
ta: இருண்ட பயன்முறை
te: డార్క్ మోడ్

source: Language
ml: ഭാഷ
ta: மொழி
te: భాష

source: Quick tour
ml: ക്വിക്ക് ടൂർ
ta: விரைவு சுற்றுப்பயணம்
te: త్వరిత టూర్

source: Show tour
ml: ടൂർ കാണിക്കുക
ta: சுற்றுப்பயணத்தைக் காட்டு
te: టూర్ చూపించు

# showIntroTourAgain
source: Show the intro tour again
ml: ആമുഖ ടൂർ വീണ്ടും കാണിക്കുക
ta: அறிமுக சுற்றுப்பயணத்தை மீண்டும் காட்டு
te: పరిచయ టూర్ మళ్ళీ చూపించు

source: Category budgets
ml: കാറ്റഗറി ബജറ്റുകൾ
ta: பிரிவு பட்ஜெட்டுகள்
te: కేటగరీ బడ్జెట్లు

# categoryBudgetsHint
source: Monthly limit per category (used for dashboard alerts).
ml: കാറ്റഗറി അനുസരിച്ച് പ്രതിമാസ ലിമിറ്റ് (ഡാഷ്ബോർഡ് അലർട്ടുകൾക്ക്).
ta: பிரிவுக்கு மாதாந்திர வரம்பு (டாஷ்போர்டு எச்சரிக்கைகளுக்கு).
te: కేటగరీకి నెలవారీ లిమిట్ (డాష్‌బోర్డ్ అలర్ట్‌లకు).

source: Edit category budgets
ml: കാറ്റഗറി ബജറ്റുകൾ എഡിറ്റ് ചെയ്യുക
ta: பிரிவு பட்ஜெட்டுகளைத் திருத்து
te: కేటగరీ బడ్జెట్లు సవరించు

source: Backup
ml: ബാക്കപ്പ്
ta: காப்புப்பிரதி
te: బ్యాకప్

# remindBackupMonthly
source: Remind me to backup monthly
ml: പ്രതിമാസം ബാക്കപ്പ് ഓർമ്മപ്പെടുത്തുക
ta: மாதாந்திர காப்புப்பிரதியை நினைவூட்டு
te: నెలవారీ బ్యాకప్ గుర్తు చేయి

source: Backup now to folder
ml: ഇപ്പോൾ ഫോൾഡറിലേക്ക് ബാക്കപ്പ്
ta: இப்போது கோப்புறையில் காப்புப்பிரதி
te: ఇప్పుడు ఫోల్డర్‌కు బ్యాకప్

# backupNowToFolderHint
source: Save a JSON backup file to a folder you choose
ml: തിരഞ്ഞെടുത്ത ഫോൾഡറിൽ JSON ബാക്കപ്പ് ഫയൽ സംരക്ഷിക്കുക
ta: தேர்ந்தெடுத்த கோப்புறையில் JSON காப்புப்பிரதி கோப்பை சேமி
te: ఎంచుకున్న ఫోల్డర్‌లో JSON బ్యాకప్ ఫైల్ సేవ్ చేయి

source: Backup now
ml: ഇപ്പോൾ ബാക്കപ്പ്
ta: இப்போது காப்புப்பிரதி
te: ఇప్పుడు బ్యాకప్

source: Security
ml: സുരക്ഷ
ta: பாதுகாப்பு
te: భద్రత

# disablePasscode
source: Disable app passcode
ml: ആപ്പ് പാസ്കോഡ് നിർജ്ജീവമാക്കുക
ta: பயன்பாட்டு கடவுச்சொல்லை முடக்கு
te: యాప్ పాస్‌కోడ్ నిలిపివేయి

# disablePasscodeHint
source: Remove passcode lock; you will not be asked for it on next launch
ml: പാസ്കോഡ് ലോക്ക് നീക്കം ചെയ്യുക; അടുത്ത തവണ തുറക്കുമ്പോൾ ചോദിക്കില്ല.
ta: கடவுச்சொல் பூட்டை அகற்று; அடுத்த திறப்பில் கேட்கப்படாது.
te: పాస్‌కోడ్ లాక్ తొలగించు; తదుపరి తెరవడంలో అడగదు.

source: Disable
ml: നിർജ്ജീവമാക്കുക
ta: முடக்கு
te: నిలిపివేయి

source: Currency
ml: കറൻസി
ta: நாணயம்
te: కరెన్సీ

source: Display currency
ml: പ്രദർശന കറൻസി
ta: காட்சி நாணயம்
te: డిస్ప్లే కరెన్సీ

source: Data
ml: ഡാറ്റ
ta: தரவு
te: డేటా

# exportTransactionsCsv
source: Export transactions to CSV
ml: ഇടപാടുകൾ CSV ആയി എക്സ്പോർട്ട് ചെയ്യുക
ta: பரிவர்த்தனைகளை CSV ஆக ஏற்றுமதி
te: లావాదేవీలను CSVగా ఎక్స్‌పోర్ట్ చేయి

# exportTransactionsCsvSubtitle
source: Copy all transactions to clipboard as CSV
ml: എല്ലാ ഇടപാടുകളും ക്ലിപ്പ്ബോർഡിലേക്ക് CSV ആയി കോപ്പി ചെയ്യുക
ta: அனைத்து பரிவர்த்தனைகளையும் CSV ஆக கிளிப்போர்டுக்கு நகலெடு
te: అన్ని లావాదేవీలను క్లిప్‌బోర్డ్‌కు CSVగా కాపీ చేయి

source: Export CSV
ml: CSV എക്സ്പോർട്ട്
ta: CSV ஏற்றுமதி
te: CSV ఎక్స్‌పోర్ట్

# exportFullBackup
source: Export full backup (JSON)
ml: പൂർണ്ണ ബാക്കപ്പ് എക്സ്പോർട്ട് ചെയ്യുക (JSON)
ta: முழு காப்புப்பிரதியை ஏற்றுமதி (JSON)
te: పూర్తి బ్యాకప్ ఎక్స్‌పోర్ట్ చేయి (JSON)

# exportFullBackupSubtitle
source: Copy all data to clipboard as JSON backup
ml: എല്ലാ ഡാറ്റയും ക്ലിപ്പ്ബോർഡിലേക്ക് JSON ബാക്കപ്പ് ആയി കോപ്പി ചെയ്യുക
ta: அனைத்து தரவையும் JSON காப்புப்பிரதியாக கிளிப்போர்டுக்கு நகலெடு
te: అన్ని డేటాను క్లిప్‌బోర్డ్‌కు JSON బ్యాకప్‌గా కాపీ చేయి

source: Export JSON
ml: JSON എക്സ്പോർട്ട്
ta: JSON ஏற்றுமதி
te: JSON ఎక్స్‌పోర్ట్

# importFromBackup
source: Import from backup (JSON)
ml: ബാക്കപ്പിൽ നിന്ന് ഇംപോർട്ട് ചെയ്യുക (JSON)
ta: காப்புப்பிரதியிலிருந்து இறக்குமதி (JSON)
te: బ్యాకప్ నుండి ఇంపోర్ట్ చేయి (JSON)

# importFromBackupSubtitle
source: Restore from a pasted JSON backup
ml: പേസ്റ്റ് ചെയ്ത JSON ബാക്കപ്പിൽ നിന്ന് പുനഃസ്ഥാപിക്കുക
ta: ஒட்டிய JSON காப்புப்பிரதியிலிருந்து மீட்டமை
te: అంటించిన JSON బ్యాకప్ నుండి పునరుద్ధరించు

source: Import JSON
ml: JSON ഇംപോർട്ട്
ta: JSON இறக்குமதி
te: JSON ఇంపోర్ట్

source: Load sample data
ml: സാമ്പിൾ ഡാറ്റ ലോഡ് ചെയ്യുക
ta: மாதிரி தரவை ஏற்று
te: నమూనా డేటా లోడ్ చేయి

# loadSampleDataHint
source: Fill app with dummy data to test dashboard, transactions, goals, income, reports
ml: ഡാഷ്ബോർഡ്, ഇടപാടുകൾ, ലക്ഷ്യങ്ങൾ, വരുമാനം, റിപ്പോർട്ടുകൾ പരിശോധിക്കാൻ ഡമ്മി ഡാറ്റ നിറയ്ക്കുക
ta: டாஷ்போர்டு, பரிவர்த்தனைகள், இலக்குகள், வருமானம், அறிக்கைகள் சோதிக்க டமி தரவுடன் நிரப்பு
te: డాష్‌బోర్డ్, లావాదేవీలు, లక్ష్యాలు, ఆదాయం, రిపోర్ట్‌లు టెస్ట్ చేయడానికి డమ్మీ డేటా నింపు

source: Load sample
ml: സാമ്പിൾ ലോഡ്
ta: மாதிரி ஏற்று
te: నమూనా లోడ్

source: Clear all data
ml: എല്ലാ ഡാറ്റയും മായ്ക്കുക
ta: அனைத்து தரவையும் அழி
te: అన్ని డేటా క్లియర్ చేయి

# clearAllDataHint
source: Remove all transactions, accounts, goals, and income. Cannot be undone.
ml: എല്ലാ ഇടപാടുകൾ, അക്കൗണ്ടുകൾ, ലക്ഷ്യങ്ങൾ, വരുമാനം നീക്കം ചെയ്യുക. മാറ്റാനാവില്ല.
ta: அனைத்து பரிவர்த்தனைகள், கணக்குகள், இலக்குகள், வருமானத்தை அகற்று. மாற்ற முடியாது.
te: అన్ని లావాదేవీలు, ఖాతాలు, లక్ష్యాలు, ఆదాయం తొలగించు. రద్దు చేయలేము.

source: Clear
ml: മായ്ക്കുക
ta: அழி
te: క్లియర్

source: About
ml: കുറിച്ച്
ta: பற்றி
te: గురించి

source: FamBudget Desktop
ml: FamBudget ഡെസ്ക്ടോപ്പ്
ta: FamBudget டெஸ்க்டாப்
te: FamBudget డెస్క్‌టాప్

source: Version
ml: പതിപ്പ്
ta: பதிப்பு
te: వెర్షన్

# tagline
source: Advanced Family Budgeting Made Simple.
ml: ഉന്നത കുടുംബ ബജറ്റിംഗ് ലളിതമാക്കി.
ta: மேம்பட்ட குடும்ப பட்ஜெட்டிங் எளிமையாக.
te: అధునాతన కుటుంబ బడ్జెట్ సరళంగా.

source: License
ml: ലൈസൻസ്
ta: உரிமம்
te: లైసెన్స్

source: View license
ml: ലൈസൻസ് കാണുക
ta: உரிமத்தைக் காட்டு
te: లైసెన్స్ చూడండి

source: Close
ml: അടയ്ക്കുക
ta: மூடு
te: మూసివేయి

source: Restore
ml: പുനഃസ്ഥാപിക്കുക
ta: மீட்டமை
te: పునరుద్ధరించు

# disablePasscodeConfirm
source: Disable passcode?
ml: പാസ്കോഡ് നിർജ്ജീവമാക്കണോ?
ta: கடவுச்சொல்லை முடக்கவா?
te: పాస్‌కోడ్ నిలిపివేయాలా?

# disablePasscodeMessage
source: The app will no longer ask for a passcode when opening.
ml: ആപ്പ് തുറക്കുമ്പോൾ ഇനി പാസ്കോഡ് ചോദിക്കില്ല.
ta: பயன்பாடு திறக்கும்போது இனி கடவுச்சொல் கேட்கப்படாது.
te: యాప్ తెరిచినప్పుడు ఇక పాస్‌కోడ్ అడగదు.

# loadSampleDataConfirm
source: Load sample data?
ml: സാമ്പിൾ ഡാറ്റ ലോഡ് ചെയ്യണോ?
ta: மாதிரி தரவை ஏற்றவா?
te: నమూనా డేటా లోడ్ చేయాలా?

# loadSampleDataConfirmMessage
source: This will replace your current data with sample accounts, transactions, goals, and income. Use this to try all features.
ml: നിലവിലെ ഡാറ്റ സാമ്പിൾ അക്കൗണ്ടുകൾ, ഇടപാടുകൾ, ലക്ഷ്യങ്ങൾ, വരുമാനം എന്നിവ കൊണ്ട് മാറ്റും. എല്ലാ ഫീച്ചറുകളും പരിശോധിക്കാൻ ഉപയോഗിക്കുക.
ta: இது உங்கள் தற்போதைய தரவை மாதிரி கணக்குகள், பரிவர்த்தனைகள், இலக்குகள், வருமானத்தால் மாற்றும். அனைத்து அம்சங்களையும் சோதிக்க பயன்படுத்துங்கள்.
te: మీ ప్రస్తుత డేటాను నమూనా ఖాతాలు, లావాదేవీలు, లక్ష్యాలు, ఆదాయంతో మారుస్తుంది. అన్ని ఫీచర్లు టెస్ట్ చేయడానికి ఉపయోగించండి.

# clearAllDataConfirm
source: Clear all data?
ml: എല്ലാ ഡാറ്റയും മായ്ക്കണോ?
ta: அனைத்து தரவையும் அழிக்கவா?
te: అన్ని డేటా క్లియర్ చేయాలా?

# clearAllDataConfirmMessage
source: This will remove all your data. This cannot be undone.
ml: നിങ്ങളുടെ എല്ലാ ഡാറ്റയും നീക്കം ചെയ്യും. ഇത് മാറ്റാനാവില്ല.
ta: இது உங்கள் அனைத்து தரவையும் அகற்றும். மாற்ற முடியாது.
te: మీ అన్ని డేటా తొలగించబడుతుంది. రద్దు చేయలేము.

# categoryBudgetsLimitHint
source: Monthly limit per category (0 = no limit).
ml: കാറ്റഗറി അനുസരിച്ച് പ്രതിമാസ ലിമിറ്റ് (0 = ലിമിറ്റില്ല).
ta: பிரிவுக்கு மாதாந்திர வரம்பு (0 = வரம்பு இல்லை).
te: కేటగరీకి నెలవారీ లిమిట్ (0 = లిమిట్ లేదు).

source: Dashboard
ml: ഡാഷ്ബോർഡ്
ta: டாஷ்போர்டு
te: డాష్‌బోర్డ్

source: Transactions
ml: ഇടപാടുകൾ
ta: பரிவர்த்தனைகள்
te: లావాదేవీలు

source: Accounts
ml: അക്കൗണ്ടുകൾ
ta: கணக்குகள்
te: ఖాతాలు

source: Goals
ml: ലക്ഷ്യങ്ങൾ
ta: இலக்குகள்
te: లక్ష్యాలు

source: Income
ml: വരുമാനം
ta: வருமானம்
te: ఆదాయం

source: Reports
ml: റിപ്പോർട്ടുകൾ
ta: அறிக்கைகள்
te: రిపోర్ట్‌లు

source: Search
ml: തിരയുക
ta: தேடு
te: వెతకండి

source: Quick add
ml: ക്വിക്ക് ചേർക്കുക
ta: விரைவு சேர்
te: త్వరిత జోడింపు

# addTransactionFull
source: Add transaction (full form)
ml: ഇടപാട് ചേർക്കുക (പൂർണ്ണ ഫോം)
ta: பரிவர்த்தனை சேர் (முழு படிவம்)
te: లావాదేవీ జోడించు (పూర్తి ఫారం)

source: English
ml: ഇംഗ്ലീഷ്
ta: ஆங்கிலம்
te: ఇంగ్లీష్

source: Spanish
ml: സ്പാനിഷ്
ta: ஸ்பானிஷ்
te: స్పానిష్

source: French
ml: ഫ്രഞ്ച്
ta: பிரெஞ்சு
te: ఫ్రెంచ్
